/*
 *  생성자 특징
 *  -> 클래스명과 동일
 *  -> 리턴형이 없다(특수메소드)
 *  -> 여러개를 만들어서 사용이 가능(오버로딩 지원)
 *  -> 매개변수가 없는 생성자(기본생성자) => 생성자가 없는 경우(자동 추가)
 *  -> 매개변수가 있는 생성자 => 사용자가 보내준 값을 받아서 메모리에 저장
 *  -> 메모리가 만들어지면 변수에 초기값을 첨부해주는 역할
 *     --------------- 객체 생성
 *  -> 초기화(외부에서 데이터 읽기, 오라클 연결, 서버연결, 자동 로그인)
 *  **** class 블럭은 구현을 할 수 없다( 선언만 가능)
 *  -> 생성자 호출시에는 반드시 new 생성자()
 *                         ---------
 *   
 *      
 *      *** static -> 클래스명.변수명, 클래스명.메소드명  Math.random()
 *      *** instance -> 객체명.변수명, 객체명.메소드명   scan.next()
 *  
 */
public class 생성자특징정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
